# Part 1 -- Intro

Load the tips dataset from seaborn

In [ ]:
import seaborn as sns # type: ignore
import numpy as np

tips = sns.load_dataset('tips')
tips

### Filter rows by `smoker == 'No'` and `total_bill >= 10`

In [ ]:
tips.loc[(tips['smoker']== 'No') & (tips['total_bill']>= 10)]

### What is the average `total_bill` for each value of `smoker`, `day`, and `time`

In [ ]:
tips.groupby(['smoker','day','time'])['total_bill'].agg(np.mean)

# Part 2 -- Tidy

Taken from the r4ds "Tidy Data" Chapter: https://r4ds.had.co.nz/exploratory-data-analysis.html

In [22]:
import pandas as pd

In [23]:
tbl1 = pd.read_csv('./data/table1.csv')

In [24]:
tbl2 = pd.read_csv('./data/table2.csv')

In [25]:
tbl3 = pd.read_csv('./data/table3.csv')

In [26]:
tbl1

       country  year   cases  population
0  Afghanistan  1999     745    19987071
1  Afghanistan  2000    2666    20595360
2       Brazil  1999   37737   172006362
3       Brazil  2000   80488   174504898
4        China  1999  212258  1272915272
5        China  2000  213766  1280428583

### Tidy the `tbl2` dataset

In [27]:
tbl2

        country  year        type       count
0   Afghanistan  1999       cases         745
1   Afghanistan  1999  population    19987071
2   Afghanistan  2000       cases        2666
3   Afghanistan  2000  population    20595360
4        Brazil  1999       cases       37737
5        Brazil  1999  population   172006362
6        Brazil  2000       cases       80488
7        Brazil  2000  population   174504898
8         China  1999       cases      212258
9         China  1999  population  1272915272
10        China  2000       cases      213766
11        China  2000  population  1280428583

In [30]:
tbl2.pivot_table(index=['country','year'],
                 columns='type',
                 values='count').reset_index()

type      country  year     cases    population
0     Afghanistan  1999     745.0  1.998707e+07
1     Afghanistan  2000    2666.0  2.059536e+07
2          Brazil  1999   37737.0  1.720064e+08
3          Brazil  2000   80488.0  1.745049e+08
4           China  1999  212258.0  1.272915e+09
5           China  2000  213766.0  1.280429e+09

### Tidy the `tbl3` dataset

In [31]:
# just give me the population
tbl3

       country  year               rate
0  Afghanistan  1999       745/19987071
1  Afghanistan  2000      2666/20595360
2       Brazil  1999    37737/172006362
3       Brazil  2000    80488/174504898
4        China  1999  212258/1272915272
5        China  2000  213766/1280428583

In [35]:
tbl3_split= tbl3['rate'].str.split('/', expand=True)

In [45]:
tbl3[['rate_split', 'population']] = tbl3_split
# tbl3.drop(['number'], axis='columns', inplace=True)
tbl3

       country  year               rate  population rate_split
0  Afghanistan  1999       745/19987071    19987071        745
1  Afghanistan  2000      2666/20595360    20595360       2666
2       Brazil  1999    37737/172006362   172006362      37737
3       Brazil  2000    80488/174504898   174504898      80488
4        China  1999  212258/1272915272  1272915272     212258
5        China  2000  213766/1280428583  1280428583     213766

In [47]:
#another method
tbl3['rate'].str.split('/').str.get(1)

0      19987071
1      20595360
2     172006362
3     174504898
4    1272915272
5    1280428583
Name: rate, dtype: object

# Part 3 -- Apply functions

Look at the `table3` dataset

In [ ]:
tbl3 = pd.read_csv('./data/table3.csv')
tbl3

### Write a function that takes a value of `rate` and parses out the total population.

In [ ]:
tbl3.dtypes

### Set the population to a new column

# Part 4 -- Plots

In [ ]:
titanic = sns.load_dataset('titanic')
titanic.head()

### Create a figure with 2 axes

### distplot of `fare` in one axes

### boxplot of `class` and `fare` on the other axes

In [17]:
import matplotlib.pyplot as plt # type: ignore
import seaborn as sns # type: ignore

# Part 5 -- Models

In [ ]:
titanic = sns.load_dataset('titanic')
titanic.head()

In [ ]:
titanic.info()

### Subset `survived`, `class`, `who`

### Create dummy encoded dataset

### Fit a logistic regression on `survived`

In [20]:
# from sklearn.linear_model import LogisticRegression